src/Catalogs/ГрафикУчетаСамочувствияСотрудников/ГрафикУчетаСамочувствияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафикУчетаСамочувствияСотрудников</name>
  <attributes>
    <name>ВремяЗамера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействительная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ГрафикУчетаСамочувствияСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет график значениями по умолчанию.
//
Процедура ЗаполнитьГрафикПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГрафикУчетаСамочувствияСотрудников.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГрафикУчетаСамочувствияСотрудников КАК ГрафикУчетаСамочувствияСотрудников";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТочкаЗамера = СоздатьЭлемент();
	ТочкаЗамера.ВремяЗамера = Дата(1,1,1,8,0,0);
	ТочкаЗамера.Записать();
	
	ТочкаЗамера = СоздатьЭлемент();
	ТочкаЗамера.ВремяЗамера = Дата(1,1,1,12,0,0);
	ТочкаЗамера.Записать();
	
	ТочкаЗамера = СоздатьЭлемент();
	ТочкаЗамера.ВремяЗамера = Дата(1,1,1,16,0,0);
	ТочкаЗамера.Записать();
	
	ТочкаЗамера = СоздатьЭлемент();
	ТочкаЗамера.ВремяЗамера = Дата(1,1,1,20,0,0);
	ТочкаЗамера.Записать();
	
КонецПроцедуры

// Возвращает действительные точки замеров с временем.
//
// Возвращаемое значение:
//  ТаблицаЗначений с колонками: ТочкаЗамера, ВремяЗамера
//
Функция ДействительныеТочкиЗамеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикУчетаСамочувствияСотрудников.Ссылка КАК ТочкаЗамера,
		|	ГрафикУчетаСамочувствияСотрудников.ВремяЗамера КАК ВремяЗамера
		|ИЗ
		|	Справочник.ГрафикУчетаСамочувствияСотрудников КАК ГрафикУчетаСамочувствияСотрудников
		|ГДЕ
		|	ГрафикУчетаСамочувствияСотрудников.Недействительная = Ложь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТочкаЗамера";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ВремяЗамера");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Формат(Данные.ВремяЗамера, "ДФ=HH:mm");
	
КонецПроцедуры

#КонецОбласти
